import React from 'react';
import {StyleSheet} from 'react-native';
import { WebView } from 'react-native-webview';


const Privacy = () => {
    return (
      <WebView
        style={styles.container}
        originWhitelist={['*']}
        source={{ uri: 'https://m.naver.com' }}
        />

      // <ScrollView>
      //   <Text>
      //     &#60;PASSME(패스미)&#62; 개인정보 처리방침
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   ::PASSME패스미::는 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제1조::개인정보의 처리 목적:: 
      //   ::PASSME패스미::는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
      //   </Text>
      //   <Text></Text>
      //   <Text></Text>

      //   <Text>
      //   1. ::PASSME패스미:: 회원 가입 및 관리
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리 시 법정 대리인의 동의여부 확인, 각종 고지·통지, 고충처리 목적으로 개인정보를 처리합니다. 
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   2. 재화 또는 서비스 제공
      //   물품-향후 추가될 상품-배송, 서비스 제공, 계약서·청구서 발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 비용결제·정산을 목적으로 개인정보를 처리합니다. 
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   3. 고충처리
      //   민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보의 목적으로 개인정보를 처리합니다. 
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제2조::개인정보의 처리 및 보유기간:: 
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   ① ::PASSME패스미::는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 동안 개인정보를 처리·보유합니다.
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
      //   </Text>
      //   <Text>
      //   1. ::PASSME패스미:: 회원 가입 및 관리 - ::PASSME패스미:: 탈퇴 시까지
      //   다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료 시까지
      //   </Text>
      //   <Text>
      //   1: 관계 법령 위반에 따른 수사·조사 등이 진행 중인 경우에는 해당 수사·조사 종료 시까지
      //   </Text>
      //   <Text>
      //   2: 홈페이지 이용에 따른 채권·채무관계 잔존 시에는 해당 채권·채무관계 정산 시까지
      //   </Text>
      //   <Text>
      //   3: 기타 예외적인 사유가 있는 경우에는 해당 예외 사유가 해소될 때까지
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   2. 재화 또는 서비스 제공 - 재화·서비스 공급완료 및 요금결제·정산 완료시까지
      //   다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료 시까지
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   1: 「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시·광고, 계약내용 및 이행 등 거래에 관한 기록
      //   </Text>
      //   <Text>
      //   - 표시·광고에 관한 기록 - 6개월
      //   </Text>
      //   <Text>
      //   - 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 - 5년
      //   </Text>
      //   <Text>
      //   - 소비자 불만 또는 분쟁처리에 관한 기록 - 3년
      //   </Text>
      //   <Text>
      //   2: 「통신비밀보호법」에 따른 통신사실확인자료 보관
      //   </Text>
      //   <Text>
      //   - 가입자 전기통신일시, 개시·종료시간, 상대방 가입자번호, 사용도수, 발신기지국 위치추적자료 - 1년
      //   </Text>
      //   <Text>
      //   - 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 - 3개월
      //   </Text>
      //   <Text>
      //   3: 행정업무의 참고 또는 사실 증명::표준 개인정보 보호지침 내 개인정보파일 보유기간 책정 기준표:: - 3년
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제3조::개인정보의 제3자 제공::
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::는 원칙적으로 이용자의 개인정보를 제1조 (개인정보의 처리 목적)에서 명시한 범위 내에서 처리하며, 이용자의 사전 동의 없이는 본래의 범위를 초과하여 처리하거나 제3자에게 제공하지 않습니다. 단, 다음의 경우에는 개인정보를 처리할 수 있습니다.
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   - 이용자가 사전에 제3자 제공 및 공개에 동의한 경우
      //   </Text>
      //   <Text>
      //   - 법령 등에 의해 제공이 요구되는 경우
      //   </Text>
      //   <Text>
      //   - 서비스의 제공에 관한 계약의 이행을 위하여 필요한 개인정보로서 경제적/기술적인 사유로 통상의 동의를 받는 것이 현저히 곤란한 경우
      //   </Text>
      //   <Text>
      //   - 개인을 식별하기에 특정할 수 없는 상태로 가공하여 기용하는 경우
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제4조::개인정보처리 위탁::
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::는 원칙적으로 이용자의 동의없이 해당 개인정보의 처리를 타인에게 위탁하지 않습니다. 향후 개인정보처리 위탁 필요가 생길 경우, 위탁대상자, 위탁업무내용, 위탁기간, 위탁계약 내용(개인정보보호 관련 법규의 준수, 개인정보에 관한 제3자 제공 금지 및 책임부담 등을 규정을 공지사항 및 개인정보처리방침을 통해 고지하겠습니다. 또한 필요한 경우 사전 동의를 받도록 하겠습니다.
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제5조::정보주체 권리·의무 및 그 행사방법::
      //   </Text>
      //   <Text>
      //   이용자는 정보주체로서 다음과 같은 권리를 행사할 수 있습니다.
      //   </Text>
      //   <Text>
      //   - 개인정보 열람 요구 - ::PASSME패스미::에서 보유하고 있는 개인정보파일은 「개인정보보호법」 제35조::개인정보의 열람::에 따라 열람을 요구할 수 있습니다. 개인정보 열람 요구 시 법 제35조 5항에 의하여 열람을 제한할 수 있습니다.
      //   </Text>
      //   <Text>
      //   1. 법률에 따라 열람이 금지되거나 제한되는 경우
      //   </Text>
      //   <Text>
      //   2. 다른 사람의 생명·신체를 해할 우려가 있거나 다른 사람의 재산과 그 밖의 이익을 부당하게 침해할 우려가 있는 경우
      //   </Text>
      //   <Text>
      //   3. 공공기관이 다음 각 목의 어느 하나에 해당하는 업무를 수행할 때 중대한 지장을 초래하는 경우
      //   </Text>
      //   <Text>
      //   가. 조세의 부과·징수 또는 환급에 관한 업무
      //   </Text>
      //   <Text>
      //   나. 「초·중등교육법」 및 「고등교육법」에 따른 각급 학교, 「평생교육법」에 따른 평생교육시설, 그 밖의 다른 법률에 따라 설치 된 고등교육기관에서의 성적 평가 또는 입학자 선발에 관한 업무
      //   </Text>
      //   <Text>
      //   다. 학력·기능 및 채용에 관한 시험, 자격 심사에 관한 업무
      //   </Text>
      //   <Text>
      //   라. 보상금·급부금 산정 등에 대하여 진행 중인 평가 또는 판단에 관한 업무
      //   </Text>
      //   <Text>
      //   마. 다른 법률에 따라 진행 중인 감사 및 조사에 관한 업무
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   개인정보 정정·삭제 요구 - ::PASSME패스미::에서 보유하고 있는 개인정보파일은 「개인정보보호법」 제36조::개인정보의 정정·삭제::에 따라 정정·삭제를 요구할 수 있습니다. 다만, 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
      //   </Text>
      //   <Text>
      //   개인정보 처리정지 요구 - ::PASSME패스미::에서 보유하고 있는 개인정보파일은 「개인정보보호법」 제37조::개인정보의 처리정지 등::에 따라 처리정지를 요구할 수 있습니다. 개인정보 처리정지 요구 시 법 제37조 2항에 의하여 처리정지 요구를 거절할 수 있습니다.
      //   </Text>
      //   <Text>
      //   1. 법률에 특별한 규정이 있거나 법령상 의무를 준수하기 위하여 불가피한 경우
      //   </Text>
      //   <Text>
      //   2. 다른 사람의 생명·신체를 해할 우려가 있거나 다른 사람의 재산과 그 밖의 이익을 부당하게 침해할 우려가 있는 경우
      //   </Text>
      //   <Text>
      //   3. 공공기관이 개인정보를 처리하지 아니하면 다른 법률에서 정하는 소관 업무를 수행할 수 없는 경우
      //   </Text>
      //   <Text>
      //   4. 개인정보를 처리하지 아니하면 정보주체와 약정한 서비스를 제공하지 못하는 등 계약의 이행이 곤란한 경우로서 정보주체가 그 계약의 해지 의사를 명확하게 밝히지 아니한 경우
      //   </Text>
      //   <Text>
      //   개인정보 열람, 정정·삭제, 처리정지 요구는 ::PASSME패스미::의 운영자에게 메일을 보내 처리절차를 진행한 후 가능합니다.
      //   </Text>       
      //   <Text></Text>
      //   <Text>
      //   제6조::처리하는 개인정보의 항목::
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::에서 서비스 제공 및 민원 처리를 위해 처리하는 개인정보 항목 및 수집 방법은 다음과 같습니다.
      //   </Text>
      //   <Text>
      //   가. 개인정보 파일명 : 교육서비스 제공 사용자 정보
      //   </Text>
      //   <Text>
      //   - 개인정보 항목::필수:: - 성명, 기관명, 직위, 연락처-전화번호, 이메일 중 택1
      //   </Text>
      //   <Text>
      //   - 수집방법 : 홈페이지, 공공 I-PIN 사이트로부터 제공받음-실명인증 관련 정보
      //   </Text>
      //   <Text>
      //   나. 개인정보 파일명 : 개인정보 열람등요구 처리 사용자 정보
      //   </Text>
      //   <Text>
      //   - 개인정보 항목::필수:: - 성명, 생년월일, 전화번호, 주소
      //   </Text>
      //   <Text>
      //   - 개인정보 항목::선택:: - 이메일, 휴대폰번호, fax번호
      //   </Text>
      //   <Text>
      //   - 수집방법 : 홈페이지, 공공 I-PIN 사이트로부터 제공받음-실명인증 관련 정보
      //   </Text>
      //   <Text>
      //   다. 개인정보 파일명 : 유출사고 신고 처리 사용자 정보
      //   </Text>
      //   <Text>
      //   - 개인정보 항목::필수:: : 성명, 기관명, 부서, 직위, 전화번호, 이메일
      //   </Text>
      //   <Text>
      //   - 수집방법 : 홈페이지
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제7조::개인정보 파기::
      //   </Text>
      //   <Text>
      //   ① ::PASSME패스미::는 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 다만, 다른 법률에 따라 보존하여야하는 경우에는 그러하지 않습니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.
      //   </Text>
      //   <Text>
      //   가. 파기절차
      //   </Text>
      //   <Text>
      //   이용자가 입력한 정보는 목적 달성 후 내부 방침 및 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다.
      //   </Text>
      //   <Text>
      //   나. 파기기한
      //   </Text>
      //   <Text>
      //   이용자의 개인정보는 개인정보의 보유기간이 경과된 경우 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.
      //   </Text>
      //   <Text>
      //   다. 파기방법
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::에서 처리하는 개인정보파일은 전자적 파일 형태로 기록되기 때문에 재생할 수 없는 기술적 방법을 사용하여 파기합니다.
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제8조::개인정보의 안전성 확보 조치::
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::는 「개인정보보호법」 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적, 관리적, 물리적 조치를 하고 있습니다.
      //   </Text>
      //   <Text>
      //   1. 내부관리계획의 수립 및 시행
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::의 내부관리계획 수립 및 시행은 행정자치부의 내부관리 지침을 준수하여 시행합니다.
      //   </Text>
      //   <Text>
      //   2. 개인정보 취급 담당자의 최소화 및 교육
      //   </Text>
      //   <Text>
      //   개인정보를 취급하는 담당자를 지정하고 최소화하여 개인정보를 관리하는 대책을 시행하고 있습니다.
      //   </Text>
      //   <Text>
      //   3. 개인정보에 대한 접근 제한
      //   </Text>
      //   <Text>
      //   개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
      //   </Text>
      //   <Text>
      //   4. 접속기록의 보관 및 위변조 방지
      //   </Text>
      //   <Text>
      //   개인정보처리시스템에 접속한 기록::웹 로그, 요약정보 등::을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능을 사용하고 있습니다.
      //   </Text>
      //   <Text>
      //   5. 개인정보의 암호화
      //   </Text>
      //   <Text>
      //   이용자의 개인정보는 암호화 되어 저장 및 관리되고 있습니다. 또한 중요한 데이터는 저장 및 전송 시 암호화하여 사용하는 등의 별도 보안기능을 사용하고 있습니다.
      //   </Text>
      //   <Text>
      //   6. 해킹 등에 대비한 기술적 대책
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다. 또한 네트워크 트래픽의 통제(Monitoring)는 물론 불법적으로 정보를 변경하는 등의 시도를 탐지하고 있습니다.
      //   </Text>
      //   <Text>
      //   7. 비인가자에 대한 출입 통제
      //   </Text>
      //   <Text>
      //   개인정보를 보관하고 있는 개인정보시스템의 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제9조::개인정보의 안전성 확보 조치::
      //   </Text>
      //   <Text>
      //   ::PASSME패스미::는 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 개인정보 보호책임자 및 실무담당자를 지정하고 있습니다. ::개인정보보호법 제31조 제1항에 따른 개인정보 보호책임자::
      //   </Text>
      //   <Text>
      //   - 개인정보 보호책임자 성명 : 지대욱
      //   </Text>
      //   <Text>
      //   - 개인정보 보호책임자 전화번호 : 010-9327-9187
      //   </Text>
      //   <Text>
      //   - 개인정보 보호책임자 이메일 : dw4157@naver.com
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제10조::개인정보 처리방침의 변경::
      //   </Text>
      //   <Text>
      //   이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 가능한 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.
      //   </Text>
      //   <Text>
      //   공고일자 : 2021년 9월 30일
      //   </Text>
      //   <Text>
      //   시행일자 : 2021년 9월 30일
      //   </Text>
      //   <Text></Text>
      //   <Text>
      //   제11조::권익침해 구제방법::
      //   </Text>
      //   <Text>
      //   정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
      //   </Text>
      //   <Text>
      //   1. 개인정보분쟁조정위원회 : 국번없이, 118-내선2번-
      //   </Text>
      //   <Text>
      //   2. 대검찰청 사이버범죄수사단 : 02-3480-3571 -cybercid@spo.go.kr
      //   </Text>
      //   <Text>
      //   3. 경찰청 사이버안전국 : 182 -http://cyber.go.kr
      //   </Text>
      // </ScrollView>
    
    );
};

export default Privacy;

const styles = StyleSheet.create({
  container: {
    margin: 10,
    
  }
})